/*global angular, console */

(function (ng) {
    'use strict';
    var mdl = angular.module('adhalizator');

    
    
    mdl.factory('Mapper', function () {
//        "S'EŠJ EŞË ƎTIX MÄGKIX FRANCUZSKIX BULOK, DA VYPEJ ČAÜ";
//        "s'ešj eşë ɘtix mägkix francuzskix bulok, da vypej čaü";
        var map = [
            ['А', 'A'], ['а', 'a'],
            ['Б', 'B'], ['б', 'b'],
            ['В', 'V'], ['в', 'v'],
            ['Г', 'G'], ['г', 'g'],
            ['Д', 'D'], ['д', 'd'],
            ['Е', 'E'], ['е', 'e'],
            ['Ё', 'Ë'], ['ё', 'ë'],
            ['Ж', 'Ž'], ['ж', 'ž'],
            ['З', 'Z'], ['з', 'z'],
            ['И', 'I'], ['и', 'i'],
            ['И', 'I'], ['и', 'i'],
            
            ['Й', 'J'], ['й', 'j'],
            ['К', 'K'], ['к', 'k'],
            ['Л', 'L'], ['л', 'l'],
            ['М', 'M'], ['м', 'm'],
            ['Н', 'N'], ['н', 'n'],
            ['О', 'O'], ['о', 'o'],
            ['П', 'P'], ['п', 'p'],
            ['Р', 'R'], ['р', 'r'],
            ['С', 'S'], ['с', 's'],
            ['Т', 'T'], ['т', 't'],
            
            ['У', 'U'], ['у', 'u'],
            ['У', 'U'], ['у', 'u'],
            ['Ф', 'F'], ['ф', 'f'],
            ['Х', 'X'], ['х', 'x'],
            ['Ц', 'C'], ['ц', 'с'],
            ['Ч', 'Č'], ['ч', 'č'],
            ['Ш', 'Š'], ['ш', 'ş'],
            ['Щ', 'Ş'], ['щ', 'ş'],
            ['Ъ', "'"], ['ъ', "'"],
            ['Ы', 'Y'], ['ы', 'y'],
            ['Ь', 'J'], ['ь', 'j'],
            ['Э', 'Ǝ'], ['э', 'ɘ'],
            ['Ю', 'Ü'], ['ю', 'ü'],
            ['Я', 'Ӓ'], ['я', 'ӓ']
        ];
        
        return {
            map: map
        };
        
  
    });
    
    
    
}(angular));

  
